Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ1064DAK176.PIC
      <edc:SFRDef edc:_addr="0x1F8103E0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC42" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC42" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PREIS" edc:desc="" edc:mask="0x3" edc:name="PREIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PREIP" edc:desc="" edc:mask="0x7" edc:name="PREIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SQI1IS" edc:desc="" edc:mask="0x3" edc:name="SQI1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SQI1IP" edc:desc="" edc:mask="0x7" edc:name="SQI1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U4EIS" edc:desc="" edc:mask="0x3" edc:name="U4EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U4EIP" edc:desc="" edc:mask="0x7" edc:name="U4EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U4RXIS" edc:desc="" edc:mask="0x3" edc:name="U4RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U4RXIP" edc:desc="" edc:mask="0x7" edc:name="U4RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103F0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC43" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC43" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U4TXIS" edc:desc="" edc:mask="0x3" edc:name="U4TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U4TXIP" edc:desc="" edc:mask="0x7" edc:name="U4TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C4BIS" edc:desc="" edc:mask="0x3" edc:name="I2C4BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C4BIP" edc:desc="" edc:mask="0x7" edc:name="I2C4BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C4SIS" edc:desc="" edc:mask="0x3" edc:name="I2C4SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C4SIP" edc:desc="" edc:mask="0x7" edc:name="I2C4SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C4MIS" edc:desc="" edc:mask="0x3" edc:name="I2C4MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C4MIP" edc:desc="" edc:mask="0x7" edc:name="I2C4MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810400" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC44" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC44" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI5EIS" edc:desc="" edc:mask="0x3" edc:name="SPI5EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5EIP" edc:desc="" edc:mask="0x7" edc:name="SPI5EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI5RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI5RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI5TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI5TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U5EIS" edc:desc="" edc:mask="0x3" edc:name="U5EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U5EIP" edc:desc="" edc:mask="0x7" edc:name="U5EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810410" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC45" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC45" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U5RXIS" edc:desc="" edc:mask="0x3" edc:name="U5RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U5RXIP" edc:desc="" edc:mask="0x7" edc:name="U5RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U5TXIS" edc:desc="" edc:mask="0x3" edc:name="U5TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U5TXIP" edc:desc="" edc:mask="0x7" edc:name="U5TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C5BIS" edc:desc="" edc:mask="0x3" edc:name="I2C5BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C5BIP" edc:desc="" edc:mask="0x7" edc:name="I2C5BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C5SIS" edc:desc="" edc:mask="0x3" edc:name="I2C5SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C5SIP" edc:desc="" edc:mask="0x7" edc:name="I2C5SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810420" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC46" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC46" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C5MIS" edc:desc="" edc:mask="0x3" edc:name="I2C5MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C5MIP" edc:desc="" edc:mask="0x7" edc:name="I2C5MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI6EIS" edc:desc="" edc:mask="0x3" edc:name="SPI6EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI6EIP" edc:desc="" edc:mask="0x7" edc:name="SPI6EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI6RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI6RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI6RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI6RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI6TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI6TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI6TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI6TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
