Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ1064DAK176.PIC
      <edc:SFRDef edc:_addr="0x1F8E3238" edc:_begin="0x234" edc:_end="0x240" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="10" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA4A" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA4A" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAADDR" edc:desc="" edc:mask="0xffffffff" edc:name="DMAADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E323C" edc:_begin="0x234" edc:_end="0x240" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="10" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA4N" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA4N" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMACOUNT" edc:desc="" edc:mask="0xffffffff" edc:name="DMACOUNT" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3240" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8E3244" edc:_begin="0x244" edc:_end="0x250" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="11" edc:access="---------------------nnnnnnnnnnn" edc:cname="USBDMA5C" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="USBDMA5C" edc:nzwidth="32" edc:por="---------------------00000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMADIR" edc:desc="" edc:mask="0x1" edc:name="DMADIR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAMODE" edc:desc="" edc:mask="0x1" edc:name="DMAMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAIE" edc:desc="" edc:mask="0x1" edc:name="DMAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAEP" edc:desc="" edc:mask="0xf" edc:name="DMAEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DMAERR" edc:desc="" edc:mask="0x1" edc:name="DMAERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMABRSTM" edc:desc="" edc:mask="0x3" edc:name="DMABRSTM" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3248" edc:_begin="0x244" edc:_end="0x250" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="11" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA5A" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA5A" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAADDR" edc:desc="" edc:mask="0xffffffff" edc:name="DMAADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E324C" edc:_begin="0x244" edc:_end="0x250" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="11" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA5N" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA5N" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMACOUNT" edc:desc="" edc:mask="0xffffffff" edc:name="DMACOUNT" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3250" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8E3254" edc:_begin="0x254" edc:_end="0x260" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="12" edc:access="---------------------nnnnnnnnnnn" edc:cname="USBDMA6C" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="USBDMA6C" edc:nzwidth="32" edc:por="---------------------00000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMADIR" edc:desc="" edc:mask="0x1" edc:name="DMADIR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAMODE" edc:desc="" edc:mask="0x1" edc:name="DMAMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAIE" edc:desc="" edc:mask="0x1" edc:name="DMAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAEP" edc:desc="" edc:mask="0xf" edc:name="DMAEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DMAERR" edc:desc="" edc:mask="0x1" edc:name="DMAERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMABRSTM" edc:desc="" edc:mask="0x3" edc:name="DMABRSTM" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3258" edc:_begin="0x254" edc:_end="0x260" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="12" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA6A" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA6A" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAADDR" edc:desc="" edc:mask="0xffffffff" edc:name="DMAADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E325C" edc:_begin="0x254" edc:_end="0x260" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="12" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA6N" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA6N" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMACOUNT" edc:desc="" edc:mask="0xffffffff" edc:name="DMACOUNT" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3260" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8E3264" edc:_begin="0x264" edc:_end="0x270" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="13" edc:access="---------------------nnnnnnnnnnn" edc:cname="USBDMA7C" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="USBDMA7C" edc:nzwidth="32" edc:por="---------------------00000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMADIR" edc:desc="" edc:mask="0x1" edc:name="DMADIR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAMODE" edc:desc="" edc:mask="0x1" edc:name="DMAMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAIE" edc:desc="" edc:mask="0x1" edc:name="DMAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAEP" edc:desc="" edc:mask="0xf" edc:name="DMAEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DMAERR" edc:desc="" edc:mask="0x1" edc:name="DMAERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMABRSTM" edc:desc="" edc:mask="0x3" edc:name="DMABRSTM" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3268" edc:_begin="0x264" edc:_end="0x270" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="13" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA7A" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA7A" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAADDR" edc:desc="" edc:mask="0xffffffff" edc:name="DMAADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E326C" edc:_begin="0x264" edc:_end="0x270" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="13" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA7N" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA7N" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMACOUNT" edc:desc="" edc:mask="0xffffffff" edc:name="DMACOUNT" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
